{
  "api": {
    "names": [
      "25015 ARROW RDG, San Antonio, TX 78258",
      "8116 Skytex St, Austin, TX 78744",
      "910 TIGER LILY, San Antonio, TX 78260",
      "6811 BLUEGRASS RUN, San Antonio, TX 78240",
      "12225 Long Bay Cv, Austin, TX 78732",
      "8822 KALLISON ARBOR, San Antonio, TX 78254",
      "9235 LASSWELL, San Antonio, TX 78211",
      "8266 Assumption Dr, San Antonio, TX 78254",
      "10502 COSMOS CYN, Helotes, TX 78023",
      "9804 Oak Hollow Dr, Austin, TX 78758"
    ],
    "descriptions": [
      "Beautifully updated home located in the sought-after Stone Oak area. Boasting a carpet-free interior with fresh paint, this home exudes modern charm with its spacious and open design. Stylish kitchen is a chef's dream, featuring stainless steel appliances, Shaker Style, soft-close cabinets a large island with a breakfast bar, marble mosaic backsplash and ample prep space. The main living area is anchored by a cozy fireplace and flows seamlessly into the adjacent dining space. The primary bedroom, conveniently located on the main level, is a true retreat with quartz countertops, a double vanity, luxurious soaking tub, walk-in shower, and an expansive walk-in closet. Upstairs, a versatile loft area provides additional living space, perfect for a game room or office, along with three generously sized bedrooms and a full bathroom. Step outside to a privacy-fenced backyard with a covered patio, ideal for quiet relaxation. Additional notable updates include: new recessed lighting throughout, new ceiling fans and front yard landscaping. Located just minutes from premier shopping, fine dining, highly-rated schools, the JW Marriott Resort, scenic golf courses, and major thoroughfares offering quick access to the airport and downtown San Antonio, this home truly has it all! Don't miss the opportunity to make this stunning property your own.",
      "This stunning property feels like a model home with all of its upgrades including an oversized lot, extended patio with 2 ceiling fans, curved staircase, media room, blackout motorized shades, antique bronze windows, upgraded lighting & so much more! The main living room & kitchen area offers a great open floorplan with soaring ceilings, fireplace & an abundance of natural light. The rest of the 1st floor consists of the spacious primary suite, an office, formal dining area, a powder bath, and a guest bedroom with access to a full bath. Upstairs you will find a large gameroom, 2 additional bedrooms, a media room, & 2 full baths. The sprawling patio & backyard are perfect for entertaining family & friends, or just relaxing after a long day. You can’t beat the location of this home which is just a short walk from Easton Park’s new 25+ acre Skyline Park featuring an outdoor amphitheater, splash pad, multiple playgrounds, downtown views, and more! Walk to The Union as well and enjoy the full gym, 2 pools, casual hangout room, conference room, and full time HOA staff who organize community events from food trucks to live bands.*Blue accent walls/ceilings will be painted before closing, per buyer request, and they are pictured as so in the photos.",
      "Welcome to 910 Tiger Lily, an exceptional two-story home in the highly sought-after Stone Oak community within Terra Bella. This beautiful home offers an open floor plan with soaring high ceilings, creating a spacious and inviting atmosphere throughout. The first level features a versatile office and a dedicated workout room, perfect for maintaining an active lifestyle. The well-appointed kitchen is a chef's dream, showcasing elegant granite countertops, a built-in gas stove, and a built-in oven and microwave. Just off the kitchen, the open living area with a fireplace creates an ideal space for entertaining. The primary bedroom suite is conveniently located on the first floor with private access to the backyard patio. The primary boasts a luxurious en-suite bathroom with double vanities, a spacious walk-in shower, and generously sized closet. Upstairs, you'll find a large game room and a media room, providing plenty of space for entertainment and relaxation. The second floor also includes three additional bedrooms and two bathrooms, with one of the bathrooms featuring a Jack and Jill setup, perfect for family living. The backyard is an entertainer's paradise with expansive covered patio space, an outdoor kitchen, and a Keith Zars heated sparkling in-ground pool and spa-ideal for hosting gatherings or enjoying peaceful evenings outdoors. Additional features include a sprinkler system for the front yard, dog run in the backyard, and energy-efficient solar panels. Situated in a top-rated school district, this home offers both luxury and convenience in one of San Antonio's most desirable neighborhoods.",
      "Located in The Fairways gated community, this exclusive 3 bedroom, 2 bathroom home has an open floor plan with rich hardwood floors and soaring ceilings. Embrace the covered front porch as you enter this bright and welcoming home. This 1-level home offers executive office/art studio/study with a view of the beautifully landscaped front yard and cul-de-sac, a second office/TV room, dining area, living room with a fireplace, laundry room, and cozy primary suite with a garden tub, dual sink vanity, and walk-in closet with shelving system. You’ll appreciate cooking in the spacious kitchen with quarts countertops, Butler’s pantry/dry bar area and storage cabinets aplenty. The backyard is low maintenance with a patio deck made from durable composite wood ready to sit back and relax. Located in the top-rated Lender ISD, Vandegrift High School. Steiner Ranch is nestled in beautiful Austin's hill country with views of Lake Travis and Balcones Canyon preserve, and a short drive to the Domain shopping and downtown Austin. Living in the Steiner Ranch community you will have access to 3 community centers with pools, parks, and miles of serene hiking trails. Steiner Ranch residents have exclusive access to the Lake Club with a pavilion, day boat dock, and boat launch conveniently located on Lake Austin. Come on and enjoy!",
      "Open House Sat Nov 23rd from 3:00 pm to 5:00 pm** Welcome to your dream home! This beautifully crafted 2-story residence boasts 4 spacious bedrooms and 3 modern bathrooms, all within 2,661 square feet of luxurious living space. Built in 2019, this home combines contemporary design with functional elegance, making it the perfect sanctuary. Step inside to find a thoughtfully designed layout featuring a Primary suite and a Guest suite conveniently located on the main floor-ideal for multi-generational living or hosting visitors. The highlight of the Primary suite is the expansive double walk-in shower in the bathroom, offering a spa-like experience right at home. Enjoy the tranquility of having no back neighbors, providing you with privacy. The covered patio invites you to relax outdoors, making it a perfect spot for morning coffee or evening gatherings. Located in the desirable Kallison Ranch community, this home is part of the Northside Independent School District (NISD) and is just 30 minutes from Lackland Air Force Base. With easy access to major highways 211 and 1604, commuting and exploring the area is a breeze. Best of all, this property has no HOA, allowing you the freedom to personalize your space without restrictions. Don't miss your chance to own this exceptional home-schedule your showing today!",
      "Located in Cross Creek, this beautiful two-story residence expertly balances style and functionality, featuring an open floor plan, four bedrooms, 2.5 bathrooms, a loft, and generous storage. Recent upgrades include roof shingles, a water softener, security system, garage opener, UV HVAC lighting, ethernet cables, and vinyl plank flooring. The kitchen boasts dark grey cabinets, granite countertops and open island, it comes with stainless steel appliances, and pendant lighting. The primary suite provides a tranquil retreat with a huge walk-in shower and large closet, while the backyard features a covered patio. Come see this great home!",
      "Welcome to your dream home in the highly sought-after Enclave at Laurel Canyon! This stunning 3,624 sq. ft. property offers 5 bedrooms, 3.5 baths, and is designed with both comfort and functionality in mind. Located in a beautifully established community with a neighborhood pool and park, this home is just minutes from The Shops at La Cantera, Fiesta Texas, SeaWorld, and an array of fine dining and entertainment options. The home features two living rooms and two dining rooms, providing plenty of space for entertaining and daily living. A cozy fireplace enhances the main living area, while the primary bedroom is conveniently located downstairs for added privacy. Upstairs, you'll find four additional bedrooms and a spacious game room, offering flexible space for family and guests. Don't miss this incredible opportunity to own a beautiful home in a prime location!",
      "Welcome to this beautifully updated 3-bedroom, 2-bathroom home, offering modern amenities and luxurious outdoor living. Step inside to discover a completely renovated interior with a stunning new kitchen and bathrooms, featuring sleek, updated finishes and brand-new flooring throughout. This home boasts an array of major upgrades, including a brand-new HVAC system, new doors and windows, and fully updated electrical systems with new main and sub panels, along with a complete house rewire for peace of mind. The attached garage has also been enhanced with a new garage door and motor for added convenience.    Outside, your private oasis awaits with an inviting in-ground pool that has been freshly replastered and outfitted with all-new, warrantied machinery, ensuring years of enjoyment. This home truly has it all—modern upgrades, a beautiful pool, and a perfect space for both relaxation and entertaining. Don't miss out on this incredible opportunity!",
      "Entertainers Dream with pool on over 2 acres! Nestled in a serene neighborhood, this exquisite 5-bedroom, 4 1/2 bath pool home boasts an impressive nearly 5000 sq ft of living space, providing ample room for both relaxation and entertainment. Upon entry, you're greeted by an abundance of natural light that floods through the open layout, highlighting the meticulous attention to detail in every corner. The spacious living areas offer versatility, perfect for cozy family gatherings or hosting lavish soirees. The heart of the home is undoubtedly the beautiful kitchen, equipped with top-of-the-line appliances, granite countertops, double ovens gas cooktop and ample cabinet space. Dual master bedrooms on first floor plus a private study and family room with 2 story stone fireplace! Upstairs boats 3 bedrooms and 2 complete bathrooms, game and media rooms with wet bar and separate walkout balcony with secluded view enjoyment! Retreat to the luxurious primary suite, featuring a private sanctuary with a spa-like ensuite bathroom, stunning views and your own entrance to the backyard complex! Step outside to your own private paradise, where a custom Keith Zars heated pool complete with grotto water fall hot tub awaits, surrounded by landscaping and a generous cabana area covered area with fireplace outdoor kitchen and cabana bath area ideal for alfresco dining and soaking up the sun. Sitting on over 2 acres there is a walking path to a second pergola area as well! This outdoor oasis offers the perfect backdrop for creating lasting memories with family and friends. Conveniently located near shops, restaurants, and recreational amenities, this home offers the ultimate blend of tranquility and convenience. Don't miss the opportunity to make this stunning pool home your own!"
    ],
    "cities": [
      {
        "name": "Paris",
        "latitude": 48.85661, 
        "longitude": 2.351499
      },
      {
        "name": "Cologne",
        "latitude": 50.938361, 
        "longitude": 6.959974
      },
      {
        "name": "Brussels",
        "latitude": 50.846557, 
        "longitude": 4.351697
      },
      {
        "name": "Amsterdam",
        "latitude": 52.370216, 
        "longitude": 4.895168
      },
      {
        "name": "Hamburg",
        "latitude": 53.550341, 
        "longitude": 10.000654
      },
      {
        "name": "Dusseldorf",
        "latitude": 51.225402, 
        "longitude": 6.776314
      }
    ],
    "types": [
      "apartment", 
      "house", 
      "room", 
      "hotel"
    ],
    "amenities": [
      "Breakfast",
      "Air conditioning", 
      "Laptop friendly workspace", 
      "Baby seat", 
      "Washer", 
      "Towels", 
      "Fridge"
    ],
    "authors": [
      "John Doe",
      "Jane Doe",
      "Arthur Morgan",
      "Barak Obama",
      "Donald Trump"
    ],
    "emails": [
      "johndoe@gmail.com",
      "jane87@gmail.com",
      "morgan@gmail.com",
      "obama@gmail.com",
      "trump@gmail.com"
    ],
    "avatars": [
      "./img/avatar1.jpg",
      "./img/avatar2.jpg",
      "./img/avatar3.jpg",
      "./img/avatar4.jpg",
      "./img/avatar5.jpg"
    ],
    "photos": [
      "./img/photo1.jpg",
      "./img/photo2.jpg",
      "./img/photo3.jpg",
      "./img/photo4.jpg",
      "./img/photo5.jpg"
    ]
  }
}
